--- a/docs/Help/markdown.md
+++ b/docs/Help/markdown.md
@@ -89,20 +102,142 @@ SmartyPants将ASCII标点字符转换为“智能”印刷标点HTML实体。例
+张三->>王五: 很好... 王五, 你怎么样?
+```
+
+```plantuml
+张三 -> 李四: 你好！李四, 最近怎么样?
+李四 -> 王五: 你最近怎么样，王五？
+李四 --x 张三: 我很好，谢谢!
+李四 -x 王五: 我很好，谢谢!
+Note right of 王五: 李四想了很长时间... \n如果文字太长，使用\\n换行 \n我是换行后的文字.
+
+李四-->>张三: 打量着王五...
+张三->>王五: 很好... 王五, 你怎么样?
+```
+
+<br>
+
@@ -116,53 +251,72 @@ gantt
-可以使用UML图表进行渲染。 [Mermaid](https://mermaidjs.github.io/). 例如下面产生的一个序列图：
+### 流程图 - Mermaid
 
-```mermaid
-sequenceDiagram
-张三 ->> 李四: 你好！李四, 最近怎么样?
-李四-->>王五: 你最近怎么样，王五？
-李四--x 张三: 我很好，谢谢!
-李四-x 王五: 我很好，谢谢!
-Note right of 王五: 李四想了很长时间, 文字太长了<br/>不适合放在一行.
+绘制流程图需要指定语言类型为`mermaid`，且在代码配置区域第一行标记；`graph LR/TD`，其中，`LR`表示左右走向，`TD`表示上下走向。如下：
 
-李四-->>张三: 打量着王五...
-张三->>王五: 很好... 王五, 你怎么样?
 ```
-
-这将产生一个流程图。:
+graph TD
